{
  "termsTitle": "Terms of Service",
  "privacyTitle": "Privacy Policy",
  "lastUpdated": "Last Updated",
  "backToHome": "Back to Home",
  "acceptance": "1. Acceptance of Terms",
  "acceptanceText": "By accessing and using this service, you accept and agree to be bound by the terms and provision of this agreement.",
  "serviceDescription": "2. Service Description",
  "serviceDescriptionText": "Our service provides a comprehensive template and theme management platform for developers and designers.",
  "userAccounts": "3. User Accounts",
  "userAccountsText": "When you create an account with us, you must provide information that is accurate, complete, and current at all times. You are responsible for:",
  "accountResponsibility1": "Safeguarding the password and all activities under your account",
  "accountResponsibility2": "Maintaining the security of your account and password",
  "accountResponsibility3": "Notifying us immediately of any unauthorized use",
  "prohibitedUse": "4. Prohibited Use",
  "prohibitedUseText": "You may not use our service:",
  "prohibited1": "For any unlawful purpose or to solicit others to unlawful acts",
  "prohibited2": "To violate any international, federal, provincial, or state regulations, rules, laws, or local ordinances",
  "prohibited3": "To infringe upon or violate our intellectual property rights or the intellectual property rights of others",
  "prohibited4": "To harass, abuse, insult, harm, defame, slander, disparage, intimidate, or discriminate",
  "intellectualProperty": "5. Intellectual Property Rights",
  "intellectualPropertyText": "The service and its original content, features, and functionality are and will remain the exclusive property of our company and its licensors.",
  "termination": "6. Termination",
  "terminationText": "We may terminate or suspend your account immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms.",
  "disclaimer": "7. Disclaimer",
  "disclaimerText": "The information on this service is provided on an 'as is' basis. To the fullest extent permitted by law, this Company excludes all representations, warranties, conditions and terms.",
  "contactUs": "8. Contact Us",
  "contactText": "If you have any questions about these Terms of Service, please contact us at support@example.com",
  "informationCollection": "1. Information We Collect",
  "informationCollectionText": "We collect information you provide directly to us, such as when you create an account, use our services, or contact us for support:",
  "personalInfo1": "Account information (name, email address, password)",
  "personalInfo2": "Profile information and preferences",
  "personalInfo3": "Communications with our support team",
  "informationUse": "2. How We Use Your Information",
  "informationUseText": "We use the information we collect to:",
  "useCase1": "Provide, maintain, and improve our services",
  "useCase2": "Process transactions and send related information",
  "useCase3": "Send technical notices and support messages",
  "useCase4": "Respond to your comments and questions",
  "informationSharing": "3. Information Sharing",
  "informationSharingText": "We do not sell, trade, or otherwise transfer your personal information to third parties without your consent, except as described in this policy.",
  "dataSecurity": "4. Data Security",
  "dataSecurityText": "We implement appropriate security measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction.",
  "cookies": "5. Cookies and Tracking",
  "cookiesText": "We use cookies and similar tracking technologies to track activity on our service and hold certain information to improve your experience.",
  "thirdPartyServices": "6. Third-Party Services",
  "thirdPartyServicesText": "Our service may contain links to third-party websites or services that are not owned or controlled by us:",
  "thirdParty1": "Google OAuth for authentication",
  "thirdParty2": "Supabase for data storage",
  "thirdParty3": "Vercel for hosting and analytics",
  "userRights": "7. Your Rights",
  "userRightsText": "You have the right to:",
  "right1": "Access and update your personal information",
  "right2": "Delete your account and associated data",
  "right3": "Opt-out of marketing communications",
  "right4": "Request a copy of your data",
  "policyChanges": "8. Changes to This Policy",
  "policyChangesText": "We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.",
  "privacyContactText": "If you have any questions about this Privacy Policy, please contact us at privacy@example.com"
}
